src/test/resources/mtosi/queryRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <header xmlns="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1"
                xmlns:ns2="http://www.tmforum.org/mtop/fmw/xsd/gen/v1"
                xmlns:ns3="http://www.tmforum.org/mtop/fmw/xsd/nam/v1"
                xmlns:ns4="http://www.tmforum.org/mtop/fmw/xsd/coi/v1"
                xmlns:ns5="http://www.tmforum.org/mtop/sb/xsd/csi/v1"
                xmlns:ns6="http://www.tmforum.org/mtop/sb/xsd/svc/v1"
                xmlns:ns7="http://www.tmforum.org/mtop/msi/xsd/sir/v1"
                xmlns:ns8="http://www.tmforum.org/mtop/nrb/xsd/cri/v1"
                xmlns:ns9="http://www.tmforum.org/mtop/nrb/xsd/itu/v1"
                xmlns:ns10="http://www.tmforum.org/mtop/nrf/xsd/gtp/v1"
                xmlns:ns11="http://www.tmforum.org/mtop/nra/xsd/ituArc/v1"
                xmlns:ns12="http://www.tmforum.org/mtop/nrb/xsd/lp/v1"
                xmlns:ns13="http://www.tmforum.org/mtop/nrf/xsd/fd/v1"
                xmlns:ns14="http://www.tmforum.org/mtop/nrf/xsd/ptp/v1"
                xmlns:ns15="http://www.tmforum.org/mtop/nrf/xsd/ftp/v1"
                xmlns:ns16="http://www.tmforum.org/mtop/nrf/xsd/ctp/v1"
                xmlns:ns17="http://www.tmforum.org/mtop/nrf/xsd/tppool/v1"
                xmlns:ns18="http://www.tmforum.org/mtop/fmw/xsd/msg/v1"
                xmlns:ns19="http://www.tmforum.org/mtop/mri/xsd/tpr/v1">
            <activityName>getServiceInventory</activityName>
            <msgName>getServiceInventoryRequest</msgName>
            <msgType>REQUEST</msgType>
            <senderURI>http://localhost:9009</senderURI>
            <destinationURI>http://145.145.64.78:9006/mtosi/msi/ServiceInventoryRetrieval</destinationURI>
            <communicationPattern>SimpleResponse</communicationPattern>
            <communicationStyle>RPC</communicationStyle>
            <timestamp>2013-07-10T21:54:05+02:00</timestamp>
        </header>
    </S:Header>
    <S:Body>
        <ns7:getServiceInventoryRequest xmlns="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1"
                                        xmlns:ns2="http://www.tmforum.org/mtop/fmw/xsd/gen/v1"
                                        xmlns:ns3="http://www.tmforum.org/mtop/fmw/xsd/nam/v1"
                                        xmlns:ns4="http://www.tmforum.org/mtop/fmw/xsd/coi/v1"
                                        xmlns:ns5="http://www.tmforum.org/mtop/sb/xsd/csi/v1"
                                        xmlns:ns6="http://www.tmforum.org/mtop/sb/xsd/svc/v1"
                                        xmlns:ns7="http://www.tmforum.org/mtop/msi/xsd/sir/v1"
                                        xmlns:ns8="http://www.tmforum.org/mtop/nrb/xsd/cri/v1"
                                        xmlns:ns9="http://www.tmforum.org/mtop/nrb/xsd/itu/v1"
                                        xmlns:ns10="http://www.tmforum.org/mtop/nrf/xsd/gtp/v1"
                                        xmlns:ns11="http://www.tmforum.org/mtop/nra/xsd/ituArc/v1"
                                        xmlns:ns12="http://www.tmforum.org/mtop/nrb/xsd/lp/v1"
                                        xmlns:ns13="http://www.tmforum.org/mtop/nrf/xsd/fd/v1"
                                        xmlns:ns14="http://www.tmforum.org/mtop/nrf/xsd/ptp/v1"
                                        xmlns:ns15="http://www.tmforum.org/mtop/nrf/xsd/ftp/v1"
                                        xmlns:ns16="http://www.tmforum.org/mtop/nrf/xsd/ctp/v1"
                                        xmlns:ns17="http://www.tmforum.org/mtop/nrf/xsd/tppool/v1"
                                        xmlns:ns18="http://www.tmforum.org/mtop/fmw/xsd/msg/v1"
                                        xmlns:ns19="http://www.tmforum.org/mtop/mri/xsd/tpr/v1">
            <ns7:filter>
                <ns7:selection>FULL</ns7:selection>
                <ns7:scope>
                    <ns7:serviceObjectType>RFS</ns7:serviceObjectType>
                </ns7:scope>
            </ns7:filter>
        </ns7:getServiceInventoryRequest>
    </S:Body>
</S:Envelope>